app/controllers/admins_controller.rb

  def index
    @products = Product.all.reverse
---
SELECT "products".* FROM "products"