app/controllers/carts_controller.rb

  def new
    @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]