app/controllers/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

    def set_category
      @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]