app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"  WHERE "orders"."user_id" = ?  [["user_id", 2]]
---
  def index
    @orders = current_user.orders

SELECT  "orders".* FROM "orders"  WHERE "orders"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @order = Order.find(params[:id])

INSERT INTO "orders" ("created_at", "total", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2016-05-30 01:15:02.720050"], ["total", 2099.79], ["updated_at", "2016-05-30 01:15:02.720050"], ["user_id", 2]]
---
  def create
    @order = Order.create(total: get_order_total, user_id: current_user.id)