app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all.reverse

INSERT INTO "products" ("created_at", "description", "image_url", "inventory_quantity", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    if @product.save

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_product
      @product = Product.find(params[:id])